# GetBlue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..GetBlue Method
ColorWithTransparency Class See Also
---
get blue
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public uint GetBlue()
```

Visual Basic
---
```text
Public Function GetBlue As UInteger
```

Visual C++
---
```text
public:
unsigned int GetBlue()
```

# ### Return Value
blue
# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace